<html>
<head>
    <style>
        .Logo{
            width: 200px;
        }
    </style>
  
    <title>Название</title>
</head>

<body>
    <header> 
    <img class="Logo" src="Logo.png">
        <ul >
            <li><a href="#B">Названия</a></li>
            <li ><a href="#C">История</a></li>
            <li><a href="#D">Собственники и руководство</a></li>
            <li ><a href="#E">Деятельность</a></li>
            <li ><a href="#J">Маркетинг</a></li>
            <li ><a href="#Q">Экология</a></li>
            <li ><a href="#L">Условия труда</a></li>
            <li ><a href="#M">Налоги</a></li>
            <li ><a href="#N">Apple и патенты</a></li>
            <li ><a href="#O">Литература</a></li>
            <li ><a href="#P">Купить продукцию Apple</a></li>
        </ul>
    </header>

    <br>
    <div class="body_t">

        <hr>
        <p>Название фирмы происходит от англ. apple (яблоко), изображение яблока использовано в логотипе. До 9 января 2007 года официальным названием корпорации на протяжении более 30 лет было «Apple Computer, Inc.». Отказ от слова «Computer» в названии
            демонстрирует смену основного фокуса корпорации с традиционного для неё рынка компьютерной техники на рынок бытовой электроники.
            <li>Имя Apple Джобс предложил из-за того, что в этом случае телефонный номер фирмы шёл в телефонном справочнике прямо перед «Atari».</li>
            <li>«Macintosh» — сорт яблок, продающийся в США — любимый сорт яблок Джефа Раскина, который был руководителем и разработчиком проекта Macintosh перед тем, как эту должность занял Стив Джобс.</li>
        </p>
        <h2>
            <article id="C"><b>История</b></article>
        </h2>
        <hr>
        <h3><b>1970-е годы</b></h3>
        <p>Компания основана в Калифорнии Стивом Джобсом и Стивом Возняком, собравшими в середине 1970-х свой первый персональный компьютер на базе процессора «MOS Technology 6502». Продав несколько десятков таких компьютеров, молодые предприниматели получили
            финансирование и официально зарегистрировали фирму Apple Computer, Inc. 1 апреля 1976 года. «Apple I», выпущенный в 1976 году, не был первым программируемым микрокомпьютером. Право первенства принадлежало микрокомпьютеру «Альтаир 8800», который
            был создан Эдом Роберсом и распространялся через каталоги в 1974—1975 годах. Однако, «Альтаир» не был «персональным компьютером», поскольку не давал возможности решать с его помощью более или менее серьёзные задачи. В 1976—1977 годах несколькими
            фирмами были выпущены первые персональные компьютеры, в том числе с 1977 года тысячами продавались кя миллионами экземпляров, стал компьютер Apple II. С 1977 по 1993 годы фирмой Apple выпускались различные модели из линейки 8 (позднее 8/16)
            разрядных компьютеров «Apple II». В конце 1970-х и начале 1980-х годов «Apомпьютеры компаний Commodore и Tandy Radio Shack. Но первым массовым персональным компьютером, выпускавшимсple II» и их клоны были самыми распространёнными в мире персональными
            компьютерами. Было продано более 5 млн компьютеров «Apple II» по всему миру.
        </p>
        <h3><b>2010-е годы</b></h3>
        <p>В 2010 году на рынок был выпущен планшетный компьютер iPad. Производство iPod, iPhone и iPad, пользовавшихся высоким спросом по всему миру, кардинальным образом улучшило финансовое положение Apple, принося компании рекордную прибыль. В августе
            2011 года Apple впервые стала самой дорогой компанией мира по рыночной капитализации, обойдя нефтяную компанию ExxonMobil, до конца года они ещё не раз менялись местами, однако с января 2012 года Apple удалось надолго закрепиться на первой
            строчке. В августе 2012 она стала самой дорогой компанией в истории, побив установленный в декабре 1999 г., на пике т. н. пузыря доткомов, рекорд Microsoft, а 21 сентября 2012, акции Apple в ходе торгов достигли своего максимума — $705,07,
            капитализация составила $662,09 млрд.[13] Со времени максимума в сентябре 2012 года к январю 2013 года капитализация Apple сократилась на 37,6 %[13], что позволило ExxonMobil вновь соперничать с ней за первое место самой дорогой публичной
            компании мира[14]. 13 ноября 2014 года вновь Apple побила свой рекорд, её капитализация составила $663,43 млрд[15]. В 2013 году корпорация Apple первой начала серийное производство 64-битных чипов ARM-архитектуры выпустив 64-битный 2-х ядерный
            микропроцессор Apple A7[16] В 2014 году корпорация представила своё первое персональное, носимое устройство — Apple Watch.
        </p>
        <h2>
            <article id="D"><b>Собственники и руководство</b></article>
        </h2>
        <hr>
        <p><span class="t">Apple</span> — публичная компания, её акции торгуются на бирже NASDAQ и Лондонской фондовой бирже. Общее количество выпущенных акций на начало 2011 года составляло 921,28 млн шт. По состоянию на 26 мая 2010 года рыночная стоимость
            компании (enterprise value) Apple превысила таковую у компании Microsoft[18]. По состоянию на март 2011 года рыночная капитализация компании оценивалась в $309,5 млрд[19]. В августе 2011 года Apple стала самой дорогой компанией мира по рыночной
            капитализации, которая на 10 августа составила $338,8 млрд[12]. По состоянию на 9 февраля 2012 года капитализация Apple достигла отметки в $456 млрд. Это превышает общую стоимость ближайших конкурентов Apple, Google и Microsoft, вместе взятых[20].
            В 2014 году Apple вернула лидерство по рыночной капитализации с суммой в $700 млрд.
        </p>
        <h2>
            <article id="E"><b>Деятельность</b></article>
        </h2>
        <hr>
        <table>
            <tr>
                <td>
                    <img src="1.png" />
                </td>
                <td>
                    <p>Компания продаёт часть своей продукции через сеть принадлежащих ей розничных магазинов Apple Store (всего более 400[27]) на территории США, Канады, Японии, Великобритании и других стран. А также занимается реализации различных товаров
                        (не только своего производства) через свои онлайн-магазины (Apple Store (online), iTunes Store и App Store), которые в 2013 году принесли компании около $18,3 млрд, что поставило компанию Apple на 2-е место после Amazon.com среди
                        компаний интернет-ретейлеров[28].</p>
                </td>
            </tr>
        </table>
        <h2>
            <article id="J"><b>Маркетинг</b></article>
        </h2>
        <p>Маркетинговая политика Apple достаточно агрессивна. Например, пользователи продуктов Apple на платформе Microsoft Windows получают сообщения об обновлениях продуктов, которые у них не установлены; опции установки этих продуктов по умолчанию включены.
            В частности, пользователям Safari предлагается установить iTunes и QuickTime; чтобы от этого отказаться, они должны сами снять соответствующие галочки в диалоге обновления.[32]</p>
        <p>Так, в марте 2008 года Apple начала предлагать пользователям iTunes для Windows установить свой веб-браузер Safari. При этом опция установки браузера включена по умолчанию, и описание у неё состоит исключительно из рекламы и ссылки на сайт:</p>
        <p align=center> <img src="2.png" /></p>
        <h2>
            <article id="Q"><b>Экология</b></article>
        </h2>
        <p>21 апреля 2011 года, Гринпис опубликовал доклад, подчеркнув тот факт, что центры обработки данных потребляют до 2 % всего мирового электричества, и эта сумма, согласно прогнозам, увеличится. Фил Рэдфорд из Гринпис сказал, что «мы обеспокоены тем,
            что этот новый взрыв в потреблении электроэнергии может загнать нас в систему старых, загрязняющих природу источников энергии вместо чистой энергии, доступной сегодня»[34]. 17 апреля 2012 года, после протеста «Гринпис» против Apple, корпорация
            выпустила заявление о том, что заканчивает использование угля и переходит к 100 % экологически чистой энергии[35][36]. В 2013 году Apple, объявила, что использует 100 % возобновляемые источники энергии для питания своих центров обработки данных,
            и в целом 75 % мощности исходит от возобновляемых источников[37]. В 2010 году Climate Counts, некоммерческая организация, занимающаяся направлением потребителей в сторону зеленых компаний, дала компании Apple 52 балла из 100 возможных, что
            ставит Apple в их высшую категорию «На пути»[38]. Это был скачок вперед по сравнению с маем 2008 года, когда Climate Counts дала Apple только 11 баллов из 100, что поместило компанию на последние место среди компаний по производству электроники,
            после чего Climate Counts также присвоила Apple «знак тугодумов», добавив, что у Apple в то время был «шанс уклониться от потребителей, переживающих за изменение климата».
        </p>
        <h2>
            <article id="L"><b>Условия труда</b></article>
        </h2>
        <p>В 2006 году Mail onSunday сообщила об условиях труда, которые существовали на заводах в Китае, где предприятия-субподрядчики Foxconn и Inventec производили iPod[57]. В статье говорится, что в одном комплексе заводов, где собирают iPod (среди прочих
            продуктов), более 200 000 рабочих жили и работали на заводе и постоянно трудились более 60 часов в неделю. В статье также сообщалось, что работники получают около $ 100 в месяц и обязаны платить компании за аренду жилья и питание, что в целом
            составляет чуть более половины заработка рабочих[58][59][60].</p>
        <p>В 2011 году Apple признала, что их поставщики в Китае используют детский труд[66].</p>
        <p><i>Рабочие на фабриках, производящих продукцию Apple, подвергаются воздействию н-гексана, нейротоксина, который является 
        более дешевой заменой этилу для очистки продуктов[67][68].</i></p>
        <p>В 2013 году China Labor Watch нашла нарушения закона и обещаний Apple об условиях труда на объектах, принадлежащих Pegatron, в том числе дискриминацию этнических меньшинств и женщин, удержание заработной платы работникам, чрезмерные рабочие часы,
            плохие условия жизни, проблемы с безопасностью и здоровьем, загрязнение окружающей среды</p>
        <h2>
            <article id="O"><b>Литература</b></article>
        </h2>
        <ul type="disc">
            <li>Адам Лашински Внутри Apple = Inside Apple. — М.: КоЛибри, Азбука-Аттикус, 2012. — 304 с. — 10 000 экз. — ISBN 978-5-389-03423-5.
                <li>Морозов Роман Ослепительная белизна // Железо : журнал. — 2011. — № 1. — С. 84—87.
        </ul>
        <hr color="#3b89e2">
        <h2 align=center>
            <h1 align=center>
                <font color="#ff8c00"><article id="P">Купить продукцию Apple</article></font>
                </h1>
        </h2>

        <table>
            <tr>
                <td>
                    <h1>Форма заказа продукции Apple:</h1>
                    <form method="POST" action="write.php">
                        <table>
                            <tr>
                                <td>Имя:</td>
                                <td><input type="text" name="name" placeholder="Имя" size="20" required pattern="^[a-zA-Z-А-Яа-яЁё\s]+$"></td>
                            </tr>
                            <tr>
                                <td>Фамилия:</td>
                                <td><input name="second_name" type="text" placeholder="Фамилия" size="20" required pattern="^[a-zA-Z-А-Яа-яЁё\s]+$"></td>
                            </tr>
                            <tr>
                                <td>Отчество:</td>
                                <td><input name="otche" type="text" placeholder="Отчество" size="20" required pattern="^[a-zA-Z-А-Яа-яЁё\s]+$"></td>
                            </tr>
                            <tr>
                                <td>Телефон:</td>
                                <td><input name="phone" type="text" placeholder="Телефон" required pattern="^[ 0-9]+$"></td>
                            </tr>
                            <tr>
                                <td>Город:</td>
                                <td><input name="city" type="text" placeholder="Город" required pattern="^[a-zA-Z-А-Яа-яЁё\s]+$"></td>
                            </tr>
                            <tr>
                                <td>Страна:</td>
                                <td><input name="country" type="text" placeholder="Страна" required pattern="^[a-zA-Z-А-Яа-яЁё\s]+$"></td>
                            </tr>
                            <tr>
                                <td>Email:</td>
                                <td><input name="email" type="text" placeholder="Email" size="40"></td>
                            </tr>
                        </table>
                        <p>Выберите телефон:</p>
                        <p><select name="tip"></p>
                <option value="Iphone 5">Iphone 5</option>
                <option value="Iphone 6">Iphone 6</option>
                <option value="Iphone 7">Iphone 7</option>
                <option value="Iphone 8">Iphone 8</option>
                <option value="Iphone X">Iphone X</option>
                <option value="Iphone 11">Iphone 11</option>
                <option value="Iphone 12">Iphone 12</option>
                </select>
                        <p> Выберите цвет телофона: </p>
                        <p><select name="color"></p>
                <option value="белый">белый</option>
                <option value="черный">черный</option>
                <option value="розовое золото">розовое золото</option>
                </select>
                            <p>Выберите носитель:</p>
                            <p><input type="radio" name="dost" value="Самовывоз" checked> Самовывоз </p>
                            <p><input type="radio" name="dost" value="В черте города" > В черте города </p>
                            <p><input type="radio" name="dost" value="По всей России" > По всей России </p>
                            <p><input type="reset" value="Сбросить"></p>
                            <p><input type="submit"  value="Отправить"></p>
                    </form>
                    <p><a href="search.php"><input type="submit" value="Просмотр базы"></a></p>
                </td>
                <td>
                    <div class="Vvideo">
                        <iframe width="560" height="315" src="https://www.youtube.com/embed/R4-YdC5N6Lo" frameborder="0"></iframe>
                    </div>

                </td>
            </tr>
        </table>
    </div>
</body>

</html>